cv.org
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+OPTIONS: H:4
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
* David Wickes
  :PROPERTIES:
  :CUSTOM_ID: david-wickes
  :END:

  An agile, iterative, and test-driven developer.

** [[http://www.acuris.com/][Acuris]]
   :PROPERTIES:
   :CUSTOM_ID: acuris
   :END:

*** /Senior Developer (June 2019 - Present)/
     :PROPERTIES:
     :CUSTOM_ID: senior-developer-june-2019---present
     :END:
- Financial journalism company, providing alerting and research services to multiple sectors.
- Worked initially on the platform team building tooling around AWS
- Moved to a product team building web applications
- Initiated and ran the departments mentoring programme

**** Skills
      :PROPERTIES:
      :CUSTOM_ID: skills-0
      :END:
- Use of graphical JavaScript libraries to display information
- [[https://martinfowler.com/eaaDev/EventSourcing.html][Event sourced]] architecture in TypeScript
- Rapid prototyping using spreadsheets as backend (both Excel and Google Sheets)
- [[https://nextjs.org/][Next.js]], a React based web framework
- Promoted the use of DevOps techniques for building software
- Configuring multiple AWS services using [[https://www.terraform.io/][Terraform]]

** [[http://www.springernature.com][SpringerNature Digital]]
   :PROPERTIES:
   :CUSTOM_ID: springernature-digital
   :END:

*** /Developer (October 2017 - June 2019)/
     :PROPERTIES:
     :CUSTOM_ID: developer-october-2017---june-2019
     :END:

- International scientific publisher
- Joined to work as part of a small innovations team, working across the company
- Dissolution of team resulted in move to high-priority payments project
- Led a weekly lunch club learning Lisp(s)

**** Skills
      :PROPERTIES:
      :CUSTOM_ID: skills
      :END:

- Small applications as experiments to gather the maximum information on real requirements
- [[https://continuousdelivery.com/][Continuous delivery]] with [[https://trunkbaseddevelopment.com/][trunk based development]]
- Leveraging modern HTML and CSS to build simple, functional web applications
- Building browser extensions as an integration point across legacy systems
- An event sourced architecture built on top of [[https://kotlinlang.org/][Kotlin]] and PostgreSQL
- Deploying applications on a [[https://www.cloudfoundry.org/][Cloud Foundry]] platform

** [[http://www.acuris.com/][Acuris]]
   :PROPERTIES:
   :CUSTOM_ID: acuris-1
   :END:

*** /Developer (January 2015 - October 2017), Lead Developer (May 2016 - September 2016)/
      :PROPERTIES:
      :CUSTOM_ID: developer-january-2015---october-2017-lead-developer-may-2016---september-2016
      :END:
- Built a web-scraping and alerting system for US bankruptcy courts using a microservice architecture.
- Contributed to creation of new content delivery pipelines for the core business
- Led a team until I asked to be allowed to focus on development
- Led and iterated on the structure for regular hackdays

**** Skills
      :PROPERTIES:
      :CUSTOM_ID: skills-1
      :END:

- Extending and upgrading NodeJS apps to use ES2015 features
- Languages - Groovy, Go, JavaScript, TypeScript
- Building frontends in vanilla JS, React and Redux
- Participated and led in learning and adoption of Go across development teams
- Building RESTful services using Express, Spark, Ratpack
- Using RabbitMQ to connect services
- Monitoring and logging using Graphite, DataDog, Logstash and Logentries
- Databases - MSSQL, Elasticsearch, MongoDB
- Web scraping using various libraries and regular expressions
- Participating in and leading retrospectives

** [[http://www.makersacademy.com/][Makers Academy]]
   :PROPERTIES:
   :CUSTOM_ID: makers-academy
   :END:

**** /Student (August 2014 - October 2014), Tutor (October 2014 - December 2014)/
      :PROPERTIES:
      :CUSTOM_ID: student-august-2014---october-2014-tutor-october-2014---december-2014
      :END:

- Full-stack web development bootcamp in Ruby, JavaScript, Rails, Sinatra and NodeJS
- Learned TDD/BDD, pair programming and other modern development practices

**** Skills
      :PROPERTIES:
      :CUSTOM_ID: skills-2
      :END:

- Ruby and JavaScript
- Frontend skills in HTML5, CSS and JQuery
- Version control with git and GitHub

** /Courses, Conferences, External Activities/
   :PROPERTIES:
   :CUSTOM_ID: courses-conferences-external-activities
   :END:

- Recent conferences: Software Craftmanship London, GopherCon Europe, QCon 2016
- Lead Developer Workshop: /Be a brilliant people developer/
- /Single Page Applications with AngularJS and TypeScript/ - Skills Matter
- [[https://www.coursera.org/account/accomplishments/records/C58NGM7GQS84][/Algorithmic Toolbox/]] by University of California, San Diego & Higher School of Economics on Coursera

*** Languages
    :PROPERTIES:
    :CUSTOM_ID: languages
    :END:

- Used in production: Kotlin, JavaScript/TypeScript, Groovy, Ruby, Go
- Used outside of work: Lisps, OCaml

** /Other Employment/
   :PROPERTIES:
   :CUSTOM_ID: other-employment
   :END:

*** Liberis
    :PROPERTIES:
    :CUSTOM_ID: liberis
    :END:

/Marketing Executive (March 2014 - August 2014)/

*** Polyglobe Group
    :PROPERTIES:
    :CUSTOM_ID: polyglobe-group
    :END:

/Marketing Executive (March 2013 - February 2014)/

** Education
   :PROPERTIES:
   :CUSTOM_ID: education
   :END:

| Dates       | Institution            | Subject(s)                                   |
|-------------+------------------------+----------------------------------------------|
| 2003 - 2005 | University of Warwick  | MA Continental Philosophy                    |
| 2000 - 2003 | University of Warwick  | BA Philosophy (1:1)                          |
| 1991 - 1998 | Wisbech Grammar School | A level Maths, Biology & Chemistry; 10 GCSEs |

** I Like
   :PROPERTIES:
   :CUSTOM_ID: i-like
   :END:

TDD, DDD, functional programming, [[https://www.chess.com/member/gypsydave5][chess]], boardgames, playing the recorder, early music, Oxford commas, and the philosophy of language.

** Contact
   :PROPERTIES:
   :CUSTOM_ID: contact
   :END:

You can reach me as @[[https://twitter.com/gypsydave5][gypsydave5]] on Twitter and [[mailto:dave@gypsydave5.com][dave.wickes@gmail.com]] by email. There's a blog ([[http://blog.gypsydave5.com/][blog.gypsydave5.com]]), and my [[https://github.com/gypsydave5][GitHub]] account too if you'd like to see what I'm up to and thinking.
