cv.tex
% Created 2020-10-28 Wed 15:09
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.5in]{geometry}
\author{gypsydave5}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={gypsydave5},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)},
 pdflang={English}}
\begin{document}

\section*{David Wickes}
\label{sec:orge3cca74}
An agile, iterative, and test-driven developer.

\subsection*{\href{http://www.acuris.com/}{Acuris}}
\label{sec:org98f882b}
\subsubsection*{\emph{Senior Developer (June 2019 - Present)}}
\label{sec:org70e8da4}
\begin{itemize}
\item Financial journalism company, providing alerting and research services to multiple sectors.
\item Worked initially on the platform team building tooling around AWS
\item Moved to a product team building web applications
\item Initiated and ran the departments mentoring programme
\end{itemize}

\paragraph*{Skills}
\label{sec:org7b53b93}
\begin{itemize}
\item Use of graphical JavaScript libraries to display information
\item \href{https://martinfowler.com/eaaDev/EventSourcing.html}{Event sourced} architecture in TypeScript
\item Rapid prototyping using spreadsheets as backend (both Excel and Google Sheets)
\item \href{https://nextjs.org/}{Next.js}, a React based web framework
\item Promoted the use of DevOps techniques for building software
\item Configuring multiple AWS services using \href{https://www.terraform.io/}{Terraform}
\end{itemize}

\subsection*{\href{http://www.springernature.com}{SpringerNature Digital}}
\label{sec:org7d13deb}
\subsubsection*{\emph{Developer (October 2017 - June 2019)}}
\label{sec:org5223faa}
\begin{itemize}
\item International scientific publisher
\item Joined to work as part of a small innovations team, working across the company
\item Dissolution of team resulted in move to high-priority payments project
\item Led a weekly lunch club learning Lisp(s)
\end{itemize}

\paragraph*{Skills}
\label{sec:org250b501}
\begin{itemize}
\item Small applications as experiments to gather the maximum information on real requirements
\item \href{https://continuousdelivery.com/}{Continuous delivery} with \href{https://trunkbaseddevelopment.com/}{trunk based development}
\item Leveraging modern HTML and CSS to build simple, functional web applications
\item Building browser extensions as an integration point across legacy systems
\item An event sourced architecture built on top of \href{https://kotlinlang.org/}{Kotlin} and PostgreSQL
\item Deploying applications on a \href{https://www.cloudfoundry.org/}{Cloud Foundry} platform
\end{itemize}

\subsection*{\href{http://www.acuris.com/}{Acuris}}
\label{sec:orge09b47d}
\subsubsection*{\emph{Developer (January 2015 - October 2017), Lead Developer (May 2016 - September 2016)}}
\label{sec:org7d99bf0}
\begin{itemize}
\item Built a web-scraping and alerting system for US bankruptcy courts using a microservice architecture.
\item Contributed to creation of new content delivery pipelines for the core business
\item Led a team until I asked to be allowed to focus on development
\item Led and iterated on the structure for regular hackdays
\end{itemize}

\paragraph*{Skills}
\label{sec:org8dc2b22}
\begin{itemize}
\item Extending and upgrading NodeJS apps to use ES2015 features
\item Languages - Groovy, Go, JavaScript, TypeScript
\item Building frontends in vanilla JS, React and Redux
\item Participated and led in learning and adoption of Go across development teams
\item Building RESTful services using Express, Spark, Ratpack
\item Using RabbitMQ to connect services
\item Monitoring and logging using Graphite, DataDog, Logstash and Logentries
\item Databases - MSSQL, Elasticsearch, MongoDB
\item Web scraping using various libraries and regular expressions
\item Participating in and leading retrospectives
\end{itemize}

\subsection*{\href{http://www.makersacademy.com/}{Makers Academy}}
\label{sec:org40d864a}
\paragraph*{\emph{Student (August 2014 - October 2014), Tutor (October 2014 - December 2014)}}
\label{sec:org480bdaa}
\begin{itemize}
\item Full-stack web development bootcamp in Ruby, JavaScript, Rails, Sinatra and NodeJS
\item Learned TDD/BDD, pair programming and other modern development practices
\end{itemize}

\paragraph*{Skills}
\label{sec:org249a5c5}
\begin{itemize}
\item Ruby and JavaScript
\item Frontend skills in HTML5, CSS and JQuery
\item Version control with git and GitHub
\end{itemize}

\subsection*{\emph{Courses, Conferences, External Activities}}
\label{sec:org2af8b82}
\begin{itemize}
\item Recent conferences: Software Craftmanship London, GopherCon Europe, QCon 2016
\item Lead Developer Workshop: \emph{Be a brilliant people developer}
\item \emph{Single Page Applications with AngularJS and TypeScript} - Skills Matter
\item \href{https://www.coursera.org/account/accomplishments/records/C58NGM7GQS84}{\emph{Algorithmic Toolbox}} by University of California, San Diego \& Higher School of Economics on Coursera
\end{itemize}

\subsubsection*{Languages}
\label{sec:orgbac53c4}
\begin{itemize}
\item Used in production: Kotlin, JavaScript/TypeScript, Groovy, Ruby, Go
\item Used outside of work: Lisps, OCaml
\end{itemize}

\subsection*{\emph{Other Employment}}
\label{sec:org0d3944e}
\subsubsection*{Liberis}
\label{sec:orgde23ffe}
\emph{Marketing Executive (March 2014 - August 2014)}

\subsubsection*{Polyglobe Group}
\label{sec:orgf457b53}
\emph{Marketing Executive (March 2013 - February 2014)}

\subsection*{Education}
\label{sec:org13e3908}
\begin{center}
\begin{tabular}{lll}
Dates & Institution & Subject(s)\\
\hline
2003 - 2005 & University of Warwick & MA Continental Philosophy\\
2000 - 2003 & University of Warwick & BA Philosophy (1:1)\\
1991 - 1998 & Wisbech Grammar School & A level Maths, Biology \& Chemistry; 10 GCSEs\\
\end{tabular}
\end{center}

\subsection*{I Like}
\label{sec:org5ad7dcc}
TDD, DDD, functional programming, \href{https://www.chess.com/member/gypsydave5}{chess}, boardgames, playing the recorder, early music, Oxford commas, and the philosophy of language.

\subsection*{Contact}
\label{sec:org78ba2ac}
You can reach me as @\href{https://twitter.com/gypsydave5}{gypsydave5} on Twitter and \href{mailto:dave@gypsydave5.com}{dave.wickes@gmail.com} by email. There's a blog (\href{http://blog.gypsydave5.com/}{blog.gypsydave5.com}), and my \href{https://github.com/gypsydave5}{GitHub} account too if you'd like to see what I'm up to and thinking.
\end{document}