cv.md


# David Wickes

An agile, iterative, and test-driven developer.


## [Acuris](http://www.acuris.com/)


### *Senior Developer (June 2019 - Present)*

-   Financial journalism company, providing alerting and research services to multiple sectors.
-   Worked initially on the platform team building tooling around AWS
-   Moved to a product team building web applications
-   Initiated and ran the departments mentoring programme
-   Acted as pro tem lead for the team


#### Skills

-   Use of graphical JavaScript libraries to display information
-   [Event sourced](https://martinfowler.com/eaaDev/EventSourcing.html) backend architecture in TypeScript
-   Rapid prototyping using spreadsheets as backend (both Excel and Google Sheets)
-   [Next.js](https://nextjs.org/), a React based web framework
-   Promoted the use of DevOps and Agile techniques for building software
-   Configuring multiple AWS services using [Terraform](https://www.terraform.io/)
-   Working with [Svelte](https://svelte.dev/)


## [SpringerNature Digital](http://www.springernature.com)


### *Developer (October 2017 - June 2019)*

-   International scientific publisher
-   Joined to work as part of a small innovations team, working across the company
-   Dissolution of team resulted in move to high-priority payments project
-   Led a weekly lunch club learning Lisp(s)


#### Skills

-   Small applications as experiments to gather the maximum information on real requirements
-   [Continuous delivery](https://continuousdelivery.com/) with [trunk based development](https://trunkbaseddevelopment.com/)
-   Leveraging modern HTML and CSS to build simple, functional web applications
-   Building browser extensions as an integration point across legacy systems
-   An event sourced architecture built on top of [Kotlin](https://kotlinlang.org/) and PostgreSQL
-   Deploying applications on a [Cloud Foundry](https://www.cloudfoundry.org/) platform


## [Acuris](http://www.acuris.com/)


### *Developer (January 2015 - October 2017), Lead Developer (May 2016 - September 2016)*

-   Built a web-scraping and alerting system for US bankruptcy courts using a microservice architecture.
-   Contributed to creation of new content delivery pipelines for the core business
-   Led a team until I asked to be allowed to focus on development
-   Led and iterated on the structure for regular hackdays


#### Skills

-   Extending and upgrading NodeJS apps to use ES2015 features
-   Languages - Groovy, Go, JavaScript, TypeScript
-   Building frontends in vanilla JS, React and Redux
-   Participated and led in learning and adoption of Go across development teams
-   Building RESTful services using Express, Spark, Ratpack
-   Using RabbitMQ to connect services
-   Monitoring and logging using Graphite, DataDog, Logstash and Logentries
-   Databases - MSSQL, Elasticsearch, MongoDB
-   Web scraping using various libraries and regular expressions
-   Participating in and leading retrospectives


## [Makers Academy](http://www.makersacademy.com/)


#### *Student (August 2014 - October 2014), Tutor (October 2014 - December 2014)*

-   Full-stack web development bootcamp in Ruby, JavaScript, Rails, Sinatra and NodeJS
-   Learned TDD/BDD, pair programming and other modern development practices


#### Skills

-   Ruby and JavaScript
-   Frontend skills in HTML5, CSS and JQuery
-   Version control with git and GitHub


## *Courses, Conferences, External Activities*

-   Recent conferences: Software Craftmanship London, GopherCon Europe, QCon 2016
-   Lead Developer Workshop: *Be a brilliant people developer*
-   *Single Page Applications with AngularJS and TypeScript* - Skills Matter
-   [*Algorithmic Toolbox*](https://www.coursera.org/account/accomplishments/records/C58NGM7GQS84) by University of California, San Diego & Higher School of Economics on Coursera


### Languages

-   Used in production: Kotlin, JavaScript/TypeScript, Groovy, Ruby, Go
-   Used outside of work: Lisps, OCaml


## *Other Employment*


### Liberis

*Marketing Executive (March 2014 - August 2014)*


### Polyglobe Group

*Marketing Executive (March 2013 - February 2014)*


## Education

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Dates</th>
<th scope="col" class="org-left">Institution</th>
<th scope="col" class="org-left">Subject(s)</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">2003 - 2005</td>
<td class="org-left">University of Warwick</td>
<td class="org-left">MA Continental Philosophy</td>
</tr>


<tr>
<td class="org-left">2000 - 2003</td>
<td class="org-left">University of Warwick</td>
<td class="org-left">BA Philosophy (1:1)</td>
</tr>


<tr>
<td class="org-left">1991 - 1998</td>
<td class="org-left">Wisbech Grammar School</td>
<td class="org-left">A level Maths, Biology & Chemistry; 10 GCSEs</td>
</tr>
</tbody>
</table>


## I Like

TDD, DDD, functional programming, [chess](https://www.chess.com/member/gypsydave5), boardgames, playing the recorder, early music, Oxford commas, and the philosophy of language.


## Contact

You can reach me as @[gypsydave5](https://twitter.com/gypsydave5) on Twitter and [dave.wickes@gmail.com](mailto:dave@gypsydave5.com) by email. There's a blog ([blog.gypsydave5.com](http://blog.gypsydave5.com/)), and my [GitHub](https://github.com/gypsydave5) account too if you'd like to see what I'm up to and thinking.
